SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[Отчет_РеестрЗаказов]
    @Родитель AS BIT = 0
AS 
BEGIN
	IF @Родитель = 1 
    BEGIN 
        SELECT 
              dbo.АвтоПолучитьСтрокой(з.UIDТовара) AS [Информация об авто]
        FROM Заказы з
        INNER JOIN ЗаказыСтатусы зс 
            ON з.IdСтатусаЗаказа = зс.IdСтатусЗаказа
    END 
    IF @Родитель = 0
    BEGIN
                SELECT 
              '№ ' + з.НомерЗаказа + ' от ' + CONVERT(VARCHAR, з.ДатаЗаказа, 104) + ' г.' AS [Номер заказа]
              ,dbo.КлиентПолучитьФИО(з.UIDКлиента) AS [ФИО клиента]
              ,dbo.АвтоПолучитьСтрокой(з.UIDТовара) AS [Информация об авто]
              ,з.СтоимостьАвто AS [Цена авто]
              ,з.СуммаОплаты AS [Сумма оплаты]
              ,CAST(((з.СуммаОплаты / dbo.ГаражПолучитьЦенуАвто(з.UIDТовара)) * 100) AS VARCHAR(10)) + '%' AS [Доля оплаты]
              ,зс.Наименование AS [Статус заказа]
              ,з.ДатаСоздания AS [Дата создания]
              ,dbo.ШтатПолучитьФИОкратко(з.UIDАвтора) AS [Автор записи]
              ,з.ДатаИзменения AS [Дата изменения]
              ,dbo.ШтатПолучитьФИОкратко(з.UIDИзменяющего) AS [Автор изменений]
        FROM Заказы з
        INNER JOIN ЗаказыСтатусы зс 
            ON з.IdСтатусаЗаказа = зс.IdСтатусЗаказа
        ORDER BY з.НомерЗаказа
    END
END 
GO